name: "img_to_text"
backend: "python"

input [
  {
    name: "image_input"
    data_type: TYPE_UINT8
    dims: [ -1, -1, 3 ]
  }
]
output [
  {
    name: "generated_text"
    data_type: TYPE_STRING
    dims: [1]
  }
]
dynamic_batching { }
